import UIKit

/*
 1. 객체지향 프로그래밍(OOP - object-oriented programming)
 클래스와 구조체를 배우기 전 객체지향 프로그래밍을 간단히만 알아보자.
 객체지향 프로그래밍에서 가장 중요한 것은 의미 있는 데이터들을 한 곳(클래스)에 모아 다루는 것이다.
 캡슐화, 상속, 추상화, 다양성을 활용할 수 있다는 특징이 있다.
 아직 클래스조차 어떤 것인지 모르기 때문에 클래스를 배우고 난 뒤 객체지향에 대한 영상을 찾아보는 것을 추천한다.
 
 만약 어떤 앱을 만드려고 하는데, 영화예매를 하거나 책을 대여하는 도서관 시스템을 만든다고 할 때
 영화는 크게 보면 제목, 감독, 출연배우, 상영시간 등 큰지막한 특징들이 있다.
 어떤 영화가 됐던 틀은 벗어나지 않으므로 클래스를 이용해 객체를 생성해서 코드를 써내려 갈 수 있다.
 도서관 또한 마찬가지로 책은 제목, 작가, 가격, 페이지 등 특징들을 모아 관리하는 방법이 있다.
 
 다른 우리와 밀접한 예시로 카카오톡에서 친구목록을 보면 프로필사진, 이름, 상태메시지 등이 있다.
 이 또한 하나의 클래스로 묶을 수 있다.
 */
